package gr.uowm.icte.kudos.kudosapp.content;

import java.util.ArrayList;
import java.util.List;

import gr.uowm.icte.kudos.kudosapp.R;
import gr.uowm.icte.kudos.kudosapp.instance.Place;

public class PlaceFactory {

    // list of places to guide
    public static List<Place> myPlaces = new ArrayList<>();

    public PlaceFactory(){
        myPlaces.clear();
        populatePlaceList();
    }

    // input some places - java style
    private void populatePlaceList() {

        myPlaces.add(new Place(
                1,
                "Αρχαιολογικός Χώρος Δίου",
                "Πιερία, Ελλάδα",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Dion_archaeological_site_102.jpg/250px-Dion_archaeological_site_102.jpg",
                40.1710885,
                22.483173,
                "Το Δίον (με παλαιότερη ονομασία Μαλαθριά) είναι μεγάλος οικισμός του νομού Πιερίας με 1.336 κατοίκους (απογραφή 2001) και ανήκει στο Δήμο Δίου - Ολύμπου). Βρίσκεται σε υψόμετρο 30 μ., στα ερείπια του αρχαίου Δίου, 15 χιλιόμετρα νότια της Κατερίνης. Αποτελεί έδρα του ομώνυμου Δημοτικού Διαμερίσματος του δήμου Δίου. Το δημοτικό διαμέρισμα έχει 2 οικισμούς, το Δίον και τα Πλατανάκια και 1.554 κατοίκους. Στον οικισμό Πλατανάκια έχουν εγκατασταθεί πρόσφυγες από την περιοχή του Ευξείνου Πόντου. Οι κύριες ασχολίες των κατοίκων είναι η γεωργία (καπνά) και η κτηνοτροφία, ενώ ο αρχαιολογικός χώρος και το Μουσείο του Δίου έχουν αναπτύξει και τουριστικά την περιοχή. Στο Δίον λειτουργεί κάθε χρόνο και Έκθεση Ψηφιδωτού στο Κέντρο Μεσογειακών Ψηφιδωτών στα πλαίσια του Φεστιβάλ Ολύμπου. Από αθλητική άποψη, πρέπει να αναφερθεί η ύπαρξη του Ομίλου Φιλάθλων Δίου, με την επωνυμία \"Ο Δίας\"."));
        myPlaces.add(new Place(
                1,
                "Κάστρο του Πλαταμώνα",
                "Πιερία, Ελλάδα",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Dion_archaeological_site_102.jpg/250px-Dion_archaeological_site_102.jpg",
                40.005358,
                22.598195,
                "Το Κάστρο του Πλαταμώνα, είναι κάστρο της Φραγκοκρατίας, χτισμένο στη θέση οχυρωμένης πόλης της Μεσοβυζαντινής περιόδου, νοτιανατολικά του Ολύμπου, σε μικρή απόσταση από τη σημερινή κωμόπολη του Πλαταμώνα, σε θέση στρατηγική που ελέγχει τον δρόμο Μακεδονίας - Θεσσαλίας - Νότιας Ελλάδας. Είναι το καλύτερα διατηρημένο κάστρο της βόρειας-κεντρικής Ελλάδας, με τον επιβλητικό κεντρικό πύργο του, που δεσπόζει πάνω στην Εθνική Οδό."));
        myPlaces.add(new Place(
                1,
                "Μινωικό Ανάκτορο Κνωσού",
                "Κρήτη, Ελλάδα",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Dion_archaeological_site_102.jpg/250px-Dion_archaeological_site_102.jpg",
                35.298002,
                25.163058,
                "Η Κνωσός ήταν η σπουδαιότερη πόλη της Κρήτης πριν την Ρωμαϊκή εποχή και, κυρίως, το κέντρο του πρώτου λαμπρού ευρωπαϊκού ανακτορικού πολιτισμού, του Μινωικού Πολιτισμού. Το ανάκτορο της πόλης είναι ο πλέον επισκέψιμος αρχαιολογικός χώρος της Κρήτης με περισσότερους από 1.000.000 επισκέπτες το χρόνο. Το ανάκτορο βρίσκεται μόλις 5χλμ νότια του Ηρακλείου, στο λόφο Κεφάλα πάνω από τις όχθες του Κνωσανού Φαραγγιού. Η πρόσβαση γίνεται μέσω της οδού Κνωσού, που ενώνει το Ηράκλειο με το Σκαλάνι. Εκτός από το χώρο του ανακτόρου, η ευρύτερη περιοχή είναι γεμάτη με αρχαιολογικά ευρήματα, γεγονός λογικό αν σκεφτούμε ότι η Κνωσός είχε στο απόγειο της περισσότερους από 100.000 κατοίκους."));
        myPlaces.add(new Place(
                1,
                "Άγαλμα Μεγάλου Αλεξάνδρου",
                "Θεσσαλονίκη, Ελλάδα",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Dion_archaeological_site_102.jpg/250px-Dion_archaeological_site_102.jpg",
                40.624174,
                22.949996,
                "Στην παραλία της Θεσσαλονίκης, δίπλα στον Λευκό Πύργο βρίσκεται το άγαλμα του Μεγάλου Αλεξάνδρου, Βασιλέα των Μακεδόνων. Αναπαριστάται ο Μέγας Αλέξανδρος να ιππέυει τον Βουκεφάλα, πολεμικό ίππο ο οποίος συνόδεψε για 20 χρόνια τον Μακεδόνα στρατηλάτη στις εκστρατείες του. Ανεγέρθηκε το 1973 με δαπάνες από ερανικές επιτροπές και εγκαινιάστηκε το 1974. Είναι έργο του γλύπτη Ευάγγελου Μουστάκα ο οποίος το φιλοτέχνησε στο εργαστήριό του στην Παλλήνη. Το μπρούντζινο άγαλμα χυτεύτηκε στα χυτήρια \"Ρέντζο Μικελούτσι\" στην Πιστόϊα της Ιταλίας.Το ύψος του αγάλματος είναι 6 μέτρα και έχει βάρος 4 τόνους. Το συνολικό ύψος μαζί με το βάθρο ανέρχεται στα 11 μέτρα."));

        myPlaces.add(new Place(
                1,
                "Παρθενώνας",
                "Αθήνα, Ελλάδα",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Dion_archaeological_site_102.jpg/250px-Dion_archaeological_site_102.jpg",
                37.971727,
                23.726763,
                "Ο Παρθενώνας είναι ναός, χτισμένος προς τιμήν της θεάς Αθηνάς, προστάτιδας της πόλης της Αθήνας. Υπήρξε το αποτέλεσμα της συνεργασίας σημαντικών αρχιτεκτόνων και γλυπτών στα μέσα του 5ου π.Χ. αιώνα. Η εποχή της κατασκευής του συνταυτίζεται με τα φιλόδοξα επεκτατικά σχέδια της Αθήνας και της πολιτικής κύρους που ακολούθησε έναντι των συμμάχων της κατά την περίοδο της αθηναϊκής ηγεμονίας στην Αρχαία Ελλάδα."));

    }
}
